<details>
<summary>Execution result of "run-all plan -lock=false" in "terragrunt/dev"</summary>

```terraform
10:50:00.625 WARN   The `TF_INPUT` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_NON_INTERACTIVE=true` instead.
10:50:01.379 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./github-oidc
- Module ./infra-cd-role
- Module ./infra-ci-role
- Module ./vpc
- Module ./wordpress-blog-tls-cert

Group 2
- Module ./eks
- Module ./rds-subnet-group

Group 3
- Module ./eks-svc
- Module ./wordpress-blog


10:50:01.964 INFO   [infra-cd-role] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-iam.git?depth=1&ref=v5.54.1 into ./infra-cd-role/.terragrunt-cache/39R9Qm_95vYWTPvFJb76UPtFcYI/3EnVVUCmsbqTbM1RfixO5_z_Z2w
10:50:01.980 INFO   [vpc] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-vpc.git?depth=1&ref=v5.19.0 into ./vpc/.terragrunt-cache/63toT4dm22Ml925jDPh0FKyl75k/A35GeYiqYDYXDWZftKtd1kkU5ic
10:50:01.983 INFO   [github-oidc] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-iam.git?depth=1&ref=v5.54.1 into ./github-oidc/.terragrunt-cache/UJdlZDEdS_F6KblU-1rQuaQkkXw/3EnVVUCmsbqTbM1RfixO5_z_Z2w
10:50:01.984 INFO   [infra-ci-role] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-iam.git?depth=1&ref=v5.54.1 into ./infra-ci-role/.terragrunt-cache/8hqMuSEaj6Aq2RonGNeUaw63lCo/3EnVVUCmsbqTbM1RfixO5_z_Z2w
10:50:01.999 INFO   [wordpress-blog-tls-cert] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-acm.git?depth=1&ref=v6.0.0 into ./wordpress-blog-tls-cert/.terragrunt-cache/uO-XQdI83UQtkOuSi2u220uLyJM/_KSLurNyeATXAamgdT7y7Gc53po
10:50:03.513 INFO   [infra-cd-role] terraform: Initializing the backend...
10:50:03.518 INFO   [infra-ci-role] terraform: Initializing the backend...
10:50:03.521 INFO   [wordpress-blog-tls-cert] terraform: Initializing the backend...
10:50:03.523 INFO   [github-oidc] terraform: Initializing the backend...
10:50:03.541 INFO   [vpc] terraform: Initializing the backend...
10:50:04.259 INFO   [vpc] terraform: 
10:50:04.259 INFO   [vpc] terraform: Successfully configured the backend "s3"! Terraform will automatically
10:50:04.260 INFO   [vpc] terraform: use this backend unless the backend configuration changes.
10:50:04.273 INFO   [infra-ci-role] terraform: 
10:50:04.273 INFO   [infra-ci-role] terraform: Successfully configured the backend "s3"! Terraform will automatically
10:50:04.273 INFO   [infra-ci-role] terraform: use this backend unless the backend configuration changes.
10:50:04.279 INFO   [infra-cd-role] terraform: 
10:50:04.279 INFO   [infra-cd-role] terraform: Successfully configured the backend "s3"! Terraform will automatically
10:50:04.279 INFO   [infra-cd-role] terraform: use this backend unless the backend configuration changes.
10:50:04.347 INFO   [github-oidc] terraform: 
10:50:04.347 INFO   [github-oidc] terraform: Successfully configured the backend "s3"! Terraform will automatically
10:50:04.347 INFO   [github-oidc] terraform: use this backend unless the backend configuration changes.
10:50:04.348 INFO   [wordpress-blog-tls-cert] terraform: 
10:50:04.348 INFO   [wordpress-blog-tls-cert] terraform: Successfully configured the backend "s3"! Terraform will automatically
10:50:04.348 INFO   [wordpress-blog-tls-cert] terraform: use this backend unless the backend configuration changes.
10:50:04.848 INFO   [infra-ci-role] terraform: Initializing provider plugins...
10:50:04.848 INFO   [infra-ci-role] terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
10:50:04.854 INFO   [infra-cd-role] terraform: Initializing provider plugins...
10:50:04.854 INFO   [infra-cd-role] terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
10:50:04.889 INFO   [vpc] terraform: Initializing provider plugins...
10:50:04.889 INFO   [vpc] terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
10:50:04.893 INFO   [wordpress-blog-tls-cert] terraform: Initializing provider plugins...
10:50:04.893 INFO   [wordpress-blog-tls-cert] terraform: - Finding hashicorp/aws versions matching ">= 6.0.0"...
10:50:04.919 INFO   [github-oidc] terraform: Initializing provider plugins...
10:50:04.919 INFO   [github-oidc] terraform: - Reusing previous version of hashicorp/tls from the dependency lock file
10:50:05.086 INFO   [infra-cd-role] terraform: - Installing hashicorp/aws v5.94.1...
10:50:05.117 INFO   [wordpress-blog-tls-cert] terraform: - Installing hashicorp/aws v6.4.0...
10:50:05.119 INFO   [github-oidc] terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
10:50:05.206 INFO   [vpc] terraform: - Installing hashicorp/aws v5.92.0...
10:50:05.300 INFO   [infra-ci-role] terraform: - Installing hashicorp/aws v5.94.1...
10:50:05.341 INFO   [github-oidc] terraform: - Installing hashicorp/aws v5.93.0...
10:50:11.439 INFO   [wordpress-blog-tls-cert] terraform: - Installed hashicorp/aws v6.4.0 (signed by HashiCorp)
10:50:11.440 INFO   [wordpress-blog-tls-cert] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
10:50:11.440 INFO   [wordpress-blog-tls-cert] terraform: selections it made above. Include this file in your version control repository
10:50:11.440 INFO   [wordpress-blog-tls-cert] terraform: so that Terraform can guarantee to make the same selections by default when
10:50:11.440 INFO   [wordpress-blog-tls-cert] terraform: you run "terraform init" in the future.
10:50:11.443 INFO   [wordpress-blog-tls-cert] terraform: Terraform has been successfully initialized!
10:50:16.744 INFO   [infra-cd-role] terraform: - Installed hashicorp/aws v5.94.1 (signed by HashiCorp)
10:50:16.745 INFO   [infra-cd-role] terraform: Terraform has been successfully initialized!
10:50:16.756 INFO   [github-oidc] terraform: - Installed hashicorp/aws v5.93.0 (signed by HashiCorp)
10:50:16.817 INFO   [infra-ci-role] terraform: - Installed hashicorp/aws v5.94.1 (signed by HashiCorp)
10:50:16.818 INFO   [infra-ci-role] terraform: Terraform has been successfully initialized!
10:50:16.841 INFO   [github-oidc] terraform: - Installing hashicorp/tls v4.0.6...
10:50:17.284 INFO   [github-oidc] terraform: - Installed hashicorp/tls v4.0.6 (signed by HashiCorp)
10:50:17.284 INFO   [github-oidc] terraform: Terraform has been successfully initialized!
10:50:17.771 STDOUT [wordpress-blog-tls-cert] terraform: aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:eu-west-1:079058212236:certificate/1ba199c9-7297-4d67-b6c0-15855117d6ba]
10:50:18.372 STDOUT [wordpress-blog-tls-cert] terraform: No changes. Your infrastructure matches the configuration.
10:50:18.372 STDOUT [wordpress-blog-tls-cert] terraform: Terraform has compared your real infrastructure against your configuration
10:50:18.372 STDOUT [wordpress-blog-tls-cert] terraform: and found no differences, so no changes are needed.
10:50:21.388 INFO   [vpc] terraform: - Installed hashicorp/aws v5.92.0 (signed by HashiCorp)
10:50:21.389 INFO   [vpc] terraform: Terraform has been successfully initialized!
10:50:21.811 STDOUT [infra-cd-role] terraform: data.aws_caller_identity.current: Reading...
10:50:21.811 STDOUT [infra-cd-role] terraform: data.aws_partition.current: Reading...
10:50:21.812 STDOUT [infra-cd-role] terraform: data.aws_partition.current: Read complete after 0s [id=aws]
10:50:21.889 STDOUT [infra-cd-role] terraform: data.aws_caller_identity.current: Read complete after 0s [id=079058212236]
10:50:21.892 STDOUT [infra-cd-role] terraform: data.aws_iam_policy_document.this[0]: Reading...
10:50:21.894 STDOUT [infra-cd-role] terraform: data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1518182356]
10:50:21.897 STDOUT [infra-cd-role] terraform: aws_iam_role.this[0]: Refreshing state... [id=github-actions-infra-apply20250712203726282900000001]
10:50:21.967 STDOUT [github-oidc] terraform: data.tls_certificate.this[0]: Reading...
10:50:22.031 STDOUT [github-oidc] terraform: data.tls_certificate.this[0]: Read complete after 0s [id=772ed8785f2c647baa040d3a1b4aa6cafacb6267]
10:50:22.053 STDOUT [infra-ci-role] terraform: data.aws_partition.current: Reading...
10:50:22.053 STDOUT [infra-ci-role] terraform: data.aws_caller_identity.current: Reading...
10:50:22.056 STDOUT [infra-ci-role] terraform: data.aws_partition.current: Read complete after 0s [id=aws]
10:50:22.134 STDOUT [infra-ci-role] terraform: data.aws_caller_identity.current: Read complete after 0s [id=079058212236]
10:50:22.137 STDOUT [infra-ci-role] terraform: data.aws_iam_policy_document.this[0]: Reading...
10:50:22.139 STDOUT [infra-ci-role] terraform: data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1518182356]
10:50:22.141 STDOUT [infra-ci-role] terraform: aws_iam_role.this[0]: Refreshing state... [id=github-actions-infra-plan20250712203726297300000001]
10:50:22.220 STDOUT [infra-cd-role] terraform: aws_iam_role_policy_attachment.this["admin"]: Refreshing state... [id=github-actions-infra-apply20250712203726282900000001-20250712203727945000000002]
10:50:22.314 STDOUT [infra-ci-role] terraform: aws_iam_role_policy_attachment.this["readonly"]: Refreshing state... [id=github-actions-infra-plan20250712203726297300000001-20250712203727874500000002]
10:50:22.314 STDOUT [infra-ci-role] terraform: aws_iam_role_policy_attachment.this["ssm"]: Refreshing state... [id=github-actions-infra-plan20250712203726297300000001-20250712203728136500000003]
10:50:22.394 STDOUT [infra-cd-role] terraform: No changes. Your infrastructure matches the configuration.
10:50:22.394 STDOUT [infra-cd-role] terraform: 
10:50:22.394 STDOUT [infra-cd-role] terraform: Terraform has compared your real infrastructure against your configuration
10:50:22.394 STDOUT [infra-cd-role] terraform: and found no differences, so no changes are needed.
10:50:22.449 STDOUT [github-oidc] terraform: data.aws_partition.current: Reading...
10:50:22.451 STDOUT [github-oidc] terraform: data.aws_partition.current: Read complete after 0s [id=aws]
10:50:22.453 STDOUT [github-oidc] terraform: aws_iam_openid_connect_provider.this[0]: Refreshing state... [id=arn:aws:iam::079058212236:oidc-provider/token.actions.githubusercontent.com]
10:50:22.541 STDOUT [infra-ci-role] terraform: No changes. Your infrastructure matches the configuration.
10:50:22.541 STDOUT [infra-ci-role] terraform: 
10:50:22.542 STDOUT [infra-ci-role] terraform: Terraform has compared your real infrastructure against your configuration
10:50:22.542 STDOUT [infra-ci-role] terraform: and found no differences, so no changes are needed.
10:50:22.643 STDOUT [github-oidc] terraform: No changes. Your infrastructure matches the configuration.
10:50:22.643 STDOUT [github-oidc] terraform: Terraform has compared your real infrastructure against your configuration
10:50:22.643 STDOUT [github-oidc] terraform: and found no differences, so no changes are needed.
10:50:25.250 STDOUT [vpc] terraform: aws_vpc.this[0]: Refreshing state... [id=vpc-0f8cc1aab31b4b4e7]
10:50:26.574 STDOUT [vpc] terraform: aws_default_security_group.this[0]: Refreshing state... [id=sg-0d3ec6aaba048175f]
10:50:26.575 STDOUT [vpc] terraform: aws_default_network_acl.this[0]: Refreshing state... [id=acl-06f35801a5bbc9177]
10:50:26.581 STDOUT [vpc] terraform: aws_subnet.public[1]: Refreshing state... [id=subnet-0c18b36e72ae6fb83]
10:50:26.584 STDOUT [vpc] terraform: aws_default_route_table.default[0]: Refreshing state... [id=rtb-049a8b5a2ef6a7e39]
10:50:26.584 STDOUT [vpc] terraform: aws_subnet.private[0]: Refreshing state... [id=subnet-0c119c091c410a4aa]
10:50:26.584 STDOUT [vpc] terraform: aws_subnet.private[1]: Refreshing state... [id=subnet-041dcd2af7ed4296f]
10:50:26.584 STDOUT [vpc] terraform: aws_route_table.private[0]: Refreshing state... [id=rtb-0f2f2a582e437df8a]
10:50:26.585 STDOUT [vpc] terraform: aws_subnet.database[0]: Refreshing state... [id=subnet-0fdf24361fba20561]
10:50:26.587 STDOUT [vpc] terraform: aws_subnet.database[1]: Refreshing state... [id=subnet-0eef5d6ed9a1ed604]
10:50:26.595 STDOUT [vpc] terraform: aws_subnet.public[0]: Refreshing state... [id=subnet-0db263db786cce0c6]
10:50:26.718 STDOUT [vpc] terraform: aws_route_table.public[0]: Refreshing state... [id=rtb-049e362e83ef6d4d7]
10:50:26.857 STDOUT [vpc] terraform: aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ef9efd2340ff5c77]
10:50:27.009 STDOUT [vpc] terraform: aws_eip.nat[0]: Refreshing state... [id=eipalloc-03bd9370997e2048a]
10:50:27.010 STDOUT [vpc] terraform: aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-049e362e83ef6d4d71080289494]
10:50:27.034 STDOUT [vpc] terraform: aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0148494146972a1eb]
10:50:27.036 STDOUT [vpc] terraform: aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e49d7b4cc0feaa28]
10:50:27.039 STDOUT [vpc] terraform: aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d8812285210f8b61]
10:50:27.039 STDOUT [vpc] terraform: aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fea45d8d99bf9795]
10:50:27.040 STDOUT [vpc] terraform: aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0441b494ba87d19c6]
10:50:27.041 STDOUT [vpc] terraform: aws_db_subnet_group.database[0]: Refreshing state... [id=tempest-dev]
10:50:27.041 STDOUT [vpc] terraform: aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0fb6904a799d20399]
10:50:27.303 STDOUT [vpc] terraform: aws_nat_gateway.this[0]: Refreshing state... [id=nat-03cf911f608921041]
10:50:27.414 STDOUT [vpc] terraform: aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f2f2a582e437df8a1080289494]
10:50:27.776 STDOUT [vpc] terraform: No changes. Your infrastructure matches the configuration.
10:50:27.777 STDOUT [vpc] terraform: Terraform has compared your real infrastructure against your configuration
10:50:27.777 STDOUT [vpc] terraform: and found no differences, so no changes are needed.
10:50:30.434 INFO   [eks] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-eks.git?depth=1&ref=v20.37.1 into ./eks/.terragrunt-cache/S2TnroGuYY_0Rdg0K0gDuahVmuc/vo8pQqWUeCu_1_TBy7LGvx51SW0
10:50:30.434 INFO   [rds-subnet-group] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-rds.git?depth=1&ref=v6.12.0 into ./rds-subnet-group/.terragrunt-cache/XEuB96Y4dtlWWThMzRUcWrpfWis/z_FacxGUMEuXC2vfXmG-YmYzcss
10:50:30.774 INFO   [eks] terraform: Initializing the backend...
10:50:30.843 INFO   [rds-subnet-group] terraform: Initializing the backend...
10:50:31.527 INFO   [eks] terraform: 
10:50:31.527 INFO   [eks] terraform: Successfully configured the backend "s3"! Terraform will automatically
10:50:31.527 INFO   [eks] terraform: use this backend unless the backend configuration changes.
10:50:31.562 INFO   [rds-subnet-group] terraform: 
10:50:31.562 INFO   [rds-subnet-group] terraform: Successfully configured the backend "s3"! Terraform will automatically
10:50:31.562 INFO   [rds-subnet-group] terraform: use this backend unless the backend configuration changes.
10:50:32.160 INFO   [rds-subnet-group] terraform: Initializing provider plugins...
10:50:32.160 INFO   [rds-subnet-group] terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
10:50:32.245 INFO   [eks] terraform: Initializing modules...
10:50:32.253 INFO   [eks] terraform: - eks_managed_node_group in modules/eks-managed-node-group
10:50:32.255 INFO   [eks] terraform: - eks_managed_node_group.user_data in modules/_user_data
10:50:32.258 INFO   [eks] terraform: - fargate_profile in modules/fargate-profile
10:50:32.337 INFO   [eks] terraform: Downloading registry.terraform.io/terraform-aws-modules/kms/aws 2.1.0 for kms...
10:50:32.377 INFO   [rds-subnet-group] terraform: - Installing hashicorp/aws v5.95.0...
10:50:32.583 INFO   [eks] terraform: - kms in .terraform/modules/kms
10:50:32.599 INFO   [eks] terraform: - self_managed_node_group in modules/self-managed-node-group
10:50:32.599 INFO   [eks] terraform: - self_managed_node_group.user_data in modules/_user_data
10:50:32.607 INFO   [eks] terraform: Initializing provider plugins...
10:50:32.607 INFO   [eks] terraform: - Reusing previous version of hashicorp/null from the dependency lock file
10:50:32.631 INFO   [eks] terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
10:50:32.678 INFO   [eks] terraform: - Reusing previous version of hashicorp/tls from the dependency lock file
10:50:32.703 INFO   [eks] terraform: - Reusing previous version of hashicorp/time from the dependency lock file
10:50:32.735 INFO   [eks] terraform: - Reusing previous version of hashicorp/cloudinit from the dependency lock file
10:50:32.904 INFO   [eks] terraform: - Installing hashicorp/tls v4.1.0...
10:50:33.253 INFO   [eks] terraform: - Installed hashicorp/tls v4.1.0 (signed by HashiCorp)
10:50:33.303 INFO   [eks] terraform: - Installing hashicorp/time v0.13.1...
10:50:33.670 INFO   [eks] terraform: - Installed hashicorp/time v0.13.1 (signed by HashiCorp)
10:50:33.822 INFO   [eks] terraform: - Installing hashicorp/cloudinit v2.3.7...
10:50:34.177 INFO   [eks] terraform: - Installed hashicorp/cloudinit v2.3.7 (signed by HashiCorp)
10:50:34.286 INFO   [eks] terraform: - Installing hashicorp/null v3.2.4...
10:50:34.628 INFO   [eks] terraform: - Installed hashicorp/null v3.2.4 (signed by HashiCorp)
10:50:34.721 INFO   [eks] terraform: - Installing hashicorp/aws v5.100.0...
10:50:39.608 INFO   [rds-subnet-group] terraform: - Installed hashicorp/aws v5.95.0 (signed by HashiCorp)
10:50:39.608 INFO   [rds-subnet-group] terraform: Terraform has been successfully initialized!
10:50:41.774 INFO   [eks] terraform: - Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
10:50:41.774 INFO   [eks] terraform: Terraform has been successfully initialized!
10:50:43.293 STDOUT [rds-subnet-group] terraform: aws_db_subnet_group.this[0]: Refreshing state... [id=tempest-dev-20250713194953201300000001]
10:50:44.033 STDOUT [rds-subnet-group] terraform: No changes. Your infrastructure matches the configuration.
10:50:44.033 STDOUT [rds-subnet-group] terraform: Terraform has compared your real infrastructure against your configuration
10:50:44.033 STDOUT [rds-subnet-group] terraform: and found no differences, so no changes are needed.
10:50:46.320 STDOUT [eks] terraform: module.kms.data.aws_partition.current[0]: Reading...
10:50:46.320 STDOUT [eks] terraform: data.aws_partition.current[0]: Reading...
10:50:46.320 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].data.aws_partition.current: Reading...
10:50:46.320 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
10:50:46.320 STDOUT [eks] terraform: module.kms.data.aws_caller_identity.current[0]: Reading...
10:50:46.320 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].data.aws_caller_identity.current: Reading...
10:50:46.320 STDOUT [eks] terraform: data.aws_iam_policy_document.assume_role_policy[0]: Reading...
10:50:46.321 STDOUT [eks] terraform: aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/tempest-dev/cluster]
10:50:46.321 STDOUT [eks] terraform: aws_security_group.cluster[0]: Refreshing state... [id=sg-0fae217a623b08972]
10:50:46.325 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].data.aws_partition.current: Read complete after 0s [id=aws]
10:50:46.325 STDOUT [eks] terraform: module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
10:50:46.326 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
10:50:46.327 STDOUT [eks] terraform: data.aws_partition.current[0]: Read complete after 0s [id=aws]
10:50:46.327 STDOUT [eks] terraform: data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
10:50:46.330 STDOUT [eks] terraform: aws_security_group.node[0]: Refreshing state... [id=sg-0e793dda82255aac4]
10:50:46.331 STDOUT [eks] terraform: data.aws_caller_identity.current[0]: Reading...
10:50:46.331 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].aws_iam_role.this[0]: Refreshing state... [id=tempest-dev-spot-big-eks-node-group-20250720182430898600000001]
10:50:46.331 STDOUT [eks] terraform: aws_iam_role.this[0]: Refreshing state... [id=tempest-dev-cluster-20250720163045635900000002]
10:50:46.333 STDOUT [eks] terraform: data.aws_iam_policy_document.custom[0]: Reading...
10:50:46.337 STDOUT [eks] terraform: data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
10:50:46.340 STDOUT [eks] terraform: aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::079058212236:policy/eks/cluster/tempest-dev-cluster-20250720163045635800000001]
10:50:46.404 STDOUT [eks] terraform: module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=079058212236]
10:50:46.483 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].data.aws_caller_identity.current: Read complete after 0s [id=079058212236]
10:50:46.509 STDOUT [eks] terraform: aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=tempest-dev-cluster-20250720163045635900000002-20250720163046987700000008]
10:50:46.509 STDOUT [eks] terraform: aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=tempest-dev-cluster-20250720163045635900000002-20250720163046942300000006]
10:50:46.510 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].aws_iam_role_policy_attachment.additional["SSM"]: Refreshing state... [id=tempest-dev-spot-big-eks-node-group-20250720182430898600000001-20250720182433000200000005]
10:50:46.510 STDOUT [eks] terraform: aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=tempest-dev-cluster-20250720163045635900000002-20250720163046953000000007]
10:50:46.512 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=tempest-dev-spot-big-eks-node-group-20250720182430898600000001-20250720182432958100000004]
10:50:46.512 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=tempest-dev-spot-big-eks-node-group-20250720182430898600000001-20250720182432750200000003]
10:50:46.551 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=tempest-dev-spot-big-eks-node-group-20250720182430898600000001-20250720182432465900000002]
10:50:46.562 STDOUT [eks] terraform: data.aws_caller_identity.current[0]: Read complete after 1s [id=079058212236]
10:50:46.563 STDOUT [eks] terraform: data.aws_iam_session_context.current[0]: Reading...
10:50:46.608 STDOUT [eks] terraform: data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::079058212236:assumed-role/github-actions-infra-plan20250712203726297300000001/gha-infra-pr]
10:50:46.612 STDOUT [eks] terraform: module.kms.data.aws_iam_policy_document.this[0]: Reading...
10:50:46.615 STDOUT [eks] terraform: module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3977968703]
10:50:46.617 STDOUT [eks] terraform: module.kms.aws_kms_key.this[0]: Refreshing state... [id=7a5088fa-d1c0-4d95-989c-ad58ea02ae02]
10:50:46.753 STDOUT [eks] terraform: aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2145994836]
10:50:46.753 STDOUT [eks] terraform: aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2479756397]
10:50:46.754 STDOUT [eks] terraform: aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2817125511]
10:50:46.754 STDOUT [eks] terraform: aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3347769987]
10:50:46.754 STDOUT [eks] terraform: aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2784433123]
10:50:46.754 STDOUT [eks] terraform: aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-1823831157]
10:50:46.754 STDOUT [eks] terraform: aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-758424649]
10:50:46.756 STDOUT [eks] terraform: aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-457735071]
10:50:46.758 STDOUT [eks] terraform: aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1674922348]
10:50:47.125 STDOUT [eks] terraform: aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-839026525]
10:50:47.126 STDOUT [eks] terraform: aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-2100647395]
10:50:47.220 STDOUT [eks] terraform: module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/tempest-dev]
10:50:47.221 STDOUT [eks] terraform: aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::079058212236:policy/tempest-dev-cluster-ClusterEncryption2025072016310867690000000d]
10:50:47.307 STDOUT [eks] terraform: aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=tempest-dev-cluster-20250720163045635900000002-2025072016310946070000000e]
10:50:47.371 STDOUT [eks] terraform: aws_eks_cluster.this[0]: Refreshing state... [id=tempest-dev]
10:50:47.849 STDOUT [eks] terraform: time_sleep.this[0]: Refreshing state... [id=2025-07-20T16:40:04Z]
10:50:47.854 STDOUT [eks] terraform: aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::079058212236:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/FD0587B907D901DB6631BFB0CFAF90DF]
10:50:47.862 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=2061208417357515898]
10:50:47.867 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].aws_launch_template.this[0]: Refreshing state... [id=lt-0d68edf4cf765334c]
10:50:48.079 STDOUT [eks] terraform: module.eks_managed_node_group["x86-spot-bigger"].aws_eks_node_group.this[0]: Refreshing state... [id=tempest-dev:tempest-dev-spot-big-20250720182439562400000008]
10:50:48.293 STDOUT [eks] terraform: aws_eks_addon.this["eks-node-monitoring-agent"]: Refreshing state... [id=tempest-dev:eks-node-monitoring-agent]
10:50:48.294 STDOUT [eks] terraform: aws_eks_addon.this["coredns"]: Refreshing state... [id=tempest-dev:coredns]
10:50:48.294 STDOUT [eks] terraform: aws_eks_addon.this["metrics-server"]: Refreshing state... [id=tempest-dev:metrics-server]
10:50:48.295 STDOUT [eks] terraform: aws_eks_addon.this["aws-efs-csi-driver"]: Refreshing state... [id=tempest-dev:aws-efs-csi-driver]
10:50:48.295 STDOUT [eks] terraform: aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=tempest-dev:kube-proxy]
10:50:48.295 STDOUT [eks] terraform: aws_eks_addon.this["eks-pod-identity-agent"]: Refreshing state... [id=tempest-dev:eks-pod-identity-agent]
10:50:48.859 STDOUT [eks] terraform: Terraform used the selected providers to generate the following execution
10:50:48.859 STDOUT [eks] terraform: plan. Resource actions are indicated with the following symbols:
10:50:48.859 STDOUT [eks] terraform:   ~ update in-place
10:50:48.859 STDOUT [eks] terraform:  <= read (data resources)
10:50:48.859 STDOUT [eks] terraform: Terraform will perform the following actions:
10:50:48.859 STDOUT [eks] terraform:   # data.aws_eks_addon_version.this["aws-efs-csi-driver"] will be read during apply
10:50:48.859 STDOUT [eks] terraform:   # (depends on a resource or a module with changes pending)
10:50:48.859 STDOUT [eks] terraform:  <= data "aws_eks_addon_version" "this" {
10:50:48.859 STDOUT [eks] terraform:       + addon_name         = "aws-efs-csi-driver"
10:50:48.859 STDOUT [eks] terraform:       + id                 = (known after apply)
10:50:48.860 STDOUT [eks] terraform:       + kubernetes_version = "1.33"
10:50:48.860 STDOUT [eks] terraform:       + most_recent        = true
10:50:48.860 STDOUT [eks] terraform:       + version            = (known after apply)
10:50:48.860 STDOUT [eks] terraform:     }
10:50:48.860 STDOUT [eks] terraform:   # data.aws_eks_addon_version.this["coredns"] will be read during apply
10:50:48.860 STDOUT [eks] terraform:   # (depends on a resource or a module with changes pending)
10:50:48.860 STDOUT [eks] terraform:  <= data "aws_eks_addon_version" "this" {
10:50:48.860 STDOUT [eks] terraform:       + addon_name         = "coredns"
10:50:48.860 STDOUT [eks] terraform:       + id                 = (known after apply)
10:50:48.860 STDOUT [eks] terraform:       + kubernetes_version = "1.33"
10:50:48.860 STDOUT [eks] terraform:       + most_recent        = true
10:50:48.860 STDOUT [eks] terraform:       + version            = (known after apply)
10:50:48.860 STDOUT [eks] terraform:     }
10:50:48.860 STDOUT [eks] terraform:   # data.aws_eks_addon_version.this["eks-node-monitoring-agent"] will be read during apply
10:50:48.860 STDOUT [eks] terraform:   # (depends on a resource or a module with changes pending)
10:50:48.860 STDOUT [eks] terraform:  <= data "aws_eks_addon_version" "this" {
10:50:48.860 STDOUT [eks] terraform:       + addon_name         = "eks-node-monitoring-agent"
10:50:48.860 STDOUT [eks] terraform:       + id                 = (known after apply)
10:50:48.860 STDOUT [eks] terraform:       + kubernetes_version = "1.33"
10:50:48.860 STDOUT [eks] terraform:       + most_recent        = true
10:50:48.860 STDOUT [eks] terraform:       + version            = (known after apply)
10:50:48.861 STDOUT [eks] terraform:     }
10:50:48.861 STDOUT [eks] terraform:   # data.aws_eks_addon_version.this["eks-pod-identity-agent"] will be read during apply
10:50:48.861 STDOUT [eks] terraform:   # (depends on a resource or a module with changes pending)
10:50:48.861 STDOUT [eks] terraform:  <= data "aws_eks_addon_version" "this" {
10:50:48.861 STDOUT [eks] terraform:       + addon_name         = "eks-pod-identity-agent"
10:50:48.861 STDOUT [eks] terraform:       + id                 = (known after apply)
10:50:48.861 STDOUT [eks] terraform:       + kubernetes_version = "1.33"
10:50:48.861 STDOUT [eks] terraform:       + most_recent        = true
10:50:48.861 STDOUT [eks] terraform:       + version            = (known after apply)
10:50:48.861 STDOUT [eks] terraform:     }
10:50:48.861 STDOUT [eks] terraform:   # data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
10:50:48.861 STDOUT [eks] terraform:   # (depends on a resource or a module with changes pending)
10:50:48.861 STDOUT [eks] terraform:  <= data "aws_eks_addon_version" "this" {
10:50:48.861 STDOUT [eks] terraform:       + addon_name         = "kube-proxy"
10:50:48.861 STDOUT [eks] terraform:       + id                 = (known after apply)
10:50:48.861 STDOUT [eks] terraform:       + kubernetes_version = "1.33"
10:50:48.861 STDOUT [eks] terraform:       + most_recent        = true
10:50:48.861 STDOUT [eks] terraform:       + version            = (known after apply)
10:50:48.861 STDOUT [eks] terraform:     }
10:50:48.861 STDOUT [eks] terraform:   # data.aws_eks_addon_version.this["metrics-server"] will be read during apply
10:50:48.861 STDOUT [eks] terraform:   # (depends on a resource or a module with changes pending)
10:50:48.861 STDOUT [eks] terraform:  <= data "aws_eks_addon_version" "this" {
10:50:48.861 STDOUT [eks] terraform:       + addon_name         = "metrics-server"
10:50:48.861 STDOUT [eks] terraform:       + id                 = (known after apply)
10:50:48.861 STDOUT [eks] terraform:       + kubernetes_version = "1.33"
10:50:48.862 STDOUT [eks] terraform:       + most_recent        = true
10:50:48.862 STDOUT [eks] terraform:       + version            = (known after apply)
10:50:48.862 STDOUT [eks] terraform:     }
10:50:48.862 STDOUT [eks] terraform:   # data.tls_certificate.this[0] will be read during apply
10:50:48.862 STDOUT [eks] terraform:   # (depends on a resource or a module with changes pending)
10:50:48.862 STDOUT [eks] terraform:  <= data "tls_certificate" "this" {
10:50:48.862 STDOUT [eks] terraform:       + certificates = (known after apply)
10:50:48.862 STDOUT [eks] terraform:       + id           = (known after apply)
10:50:48.862 STDOUT [eks] terraform:       + url          = "https://oidc.eks.eu-west-1.amazonaws.com/id/FD0587B907D901DB6631BFB0CFAF90DF"
10:50:48.862 STDOUT [eks] terraform:     }
10:50:48.862 STDOUT [eks] terraform:   # aws_eks_addon.this["aws-efs-csi-driver"] will be updated in-place
10:50:48.862 STDOUT [eks] terraform:   ~ resource "aws_eks_addon" "this" {
10:50:48.862 STDOUT [eks] terraform:       ~ addon_version               = "v2.1.9-eksbuild.1" -> (known after apply)
10:50:48.862 STDOUT [eks] terraform:         id                          = "tempest-dev:aws-efs-csi-driver"
10:50:48.862 STDOUT [eks] terraform:         tags                        = {}
10:50:48.862 STDOUT [eks] terraform:         # (11 unchanged attributes hidden)
10:50:48.862 STDOUT [eks] terraform:         # (1 unchanged block hidden)
10:50:48.863 STDOUT [eks] terraform:     }
10:50:48.863 STDOUT [eks] terraform:   # aws_eks_addon.this["coredns"] will be updated in-place
10:50:48.863 STDOUT [eks] terraform:   ~ resource "aws_eks_addon" "this" {
10:50:48.863 STDOUT [eks] terraform:       ~ addon_version               = "v1.12.2-eksbuild.4" -> (known after apply)
10:50:48.863 STDOUT [eks] terraform:         id                          = "tempest-dev:coredns"
10:50:48.863 STDOUT [eks] terraform:         tags                        = {}
10:50:48.863 STDOUT [eks] terraform:         # (11 unchanged attributes hidden)
10:50:48.863 STDOUT [eks] terraform:         # (1 unchanged block hidden)
10:50:48.863 STDOUT [eks] terraform:     }
10:50:48.863 STDOUT [eks] terraform:   # aws_eks_addon.this["eks-node-monitoring-agent"] will be updated in-place
10:50:48.863 STDOUT [eks] terraform:   ~ resource "aws_eks_addon" "this" {
10:50:48.863 STDOUT [eks] terraform:       ~ addon_version               = "v1.3.0-eksbuild.2" -> (known after apply)
10:50:48.863 STDOUT [eks] terraform:         id                          = "tempest-dev:eks-node-monitoring-agent"
10:50:48.863 STDOUT [eks] terraform:         tags                        = {}
10:50:48.863 STDOUT [eks] terraform:         # (11 unchanged attributes hidden)
10:50:48.864 STDOUT [eks] terraform:         # (1 unchanged block hidden)
10:50:48.864 STDOUT [eks] terraform:     }
10:50:48.864 STDOUT [eks] terraform:   # aws_eks_addon.this["eks-pod-identity-agent"] will be updated in-place
10:50:48.864 STDOUT [eks] terraform:   ~ resource "aws_eks_addon" "this" {
10:50:48.864 STDOUT [eks] terraform:       ~ addon_version               = "v1.3.8-eksbuild.2" -> (known after apply)
10:50:48.864 STDOUT [eks] terraform:         id                          = "tempest-dev:eks-pod-identity-agent"
10:50:48.864 STDOUT [eks] terraform:         tags                        = {}
10:50:48.864 STDOUT [eks] terraform:         # (11 unchanged attributes hidden)
10:50:48.864 STDOUT [eks] terraform:         # (1 unchanged block hidden)
10:50:48.864 STDOUT [eks] terraform:     }
10:50:48.864 STDOUT [eks] terraform:   # aws_eks_addon.this["kube-proxy"] will be updated in-place
10:50:48.864 STDOUT [eks] terraform:   ~ resource "aws_eks_addon" "this" {
10:50:48.864 STDOUT [eks] terraform:       ~ addon_version               = "v1.33.0-eksbuild.2" -> (known after apply)
10:50:48.865 STDOUT [eks] terraform:         id                          = "tempest-dev:kube-proxy"
10:50:48.865 STDOUT [eks] terraform:         tags                        = {}
10:50:48.865 STDOUT [eks] terraform:         # (11 unchanged attributes hidden)
10:50:48.865 STDOUT [eks] terraform:         # (1 unchanged block hidden)
10:50:48.865 STDOUT [eks] terraform:     }
10:50:48.865 STDOUT [eks] terraform:   # aws_eks_addon.this["metrics-server"] will be updated in-place
10:50:48.865 STDOUT [eks] terraform:   ~ resource "aws_eks_addon" "this" {
10:50:48.865 STDOUT [eks] terraform:       ~ addon_version               = "v0.8.0-eksbuild.1" -> (known after apply)
10:50:48.865 STDOUT [eks] terraform:         id                          = "tempest-dev:metrics-server"
10:50:48.865 STDOUT [eks] terraform:         tags                        = {}
10:50:48.865 STDOUT [eks] terraform:         # (11 unchanged attributes hidden)
10:50:48.865 STDOUT [eks] terraform:         # (1 unchanged block hidden)
10:50:48.865 STDOUT [eks] terraform:     }
10:50:48.865 STDOUT [eks] terraform:   # aws_eks_cluster.this[0] will be updated in-place
10:50:48.866 STDOUT [eks] terraform:   ~ resource "aws_eks_cluster" "this" {
10:50:48.866 STDOUT [eks] terraform:         id                            = "tempest-dev"
10:50:48.866 STDOUT [eks] terraform:         name                          = "tempest-dev"
10:50:48.866 STDOUT [eks] terraform:         tags                          = {
10:50:48.866 STDOUT [eks] terraform:             "terraform-aws-modules" = "eks"
10:50:48.866 STDOUT [eks] terraform:         }
10:50:48.866 STDOUT [eks] terraform:         # (12 unchanged attributes hidden)
10:50:48.866 STDOUT [eks] terraform:       ~ vpc_config {
10:50:48.866 STDOUT [eks] terraform:           ~ public_access_cidrs       = [
10:50:48.866 STDOUT [eks] terraform:               - "0.0.0.0/0",
10:50:48.866 STDOUT [eks] terraform:                 # (1 unchanged element hidden)
10:50:48.866 STDOUT [eks] terraform:             ]
10:50:48.866 STDOUT [eks] terraform:             # (6 unchanged attributes hidden)
10:50:48.866 STDOUT [eks] terraform:         }
10:50:48.866 STDOUT [eks] terraform:         # (5 unchanged blocks hidden)
10:50:48.867 STDOUT [eks] terraform:     }
10:50:48.867 STDOUT [eks] terraform:   # aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
10:50:48.867 STDOUT [eks] terraform:   ~ resource "aws_iam_openid_connect_provider" "oidc_provider" {
10:50:48.867 STDOUT [eks] terraform:         id              = "arn:aws:iam::079058212236:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/FD0587B907D901DB6631BFB0CFAF90DF"
10:50:48.867 STDOUT [eks] terraform:         tags            = {
10:50:48.867 STDOUT [eks] terraform:             "Name" = "tempest-dev-eks-irsa"
10:50:48.867 STDOUT [eks] terraform:         }
10:50:48.867 STDOUT [eks] terraform:       ~ thumbprint_list = [
10:50:48.867 STDOUT [eks] terraform:           - "06b25927c42a721631c1efd9431e648fa62e1e39",
10:50:48.868 STDOUT [eks] terraform:         ] -> (known after apply)
10:50:48.868 STDOUT [eks] terraform:         # (4 unchanged attributes hidden)
10:50:48.868 STDOUT [eks] terraform:     }
10:50:48.868 STDOUT [eks] terraform:   # module.kms.aws_kms_key.this[0] will be updated in-place
10:50:48.868 STDOUT [eks] terraform:   ~ resource "aws_kms_key" "this" {
10:50:48.868 STDOUT [eks] terraform:         id                                 = "7a5088fa-d1c0-4d95-989c-ad58ea02ae02"
10:50:48.868 STDOUT [eks] terraform:       ~ policy                             = jsonencode(
10:50:48.868 STDOUT [eks] terraform:           ~ {
10:50:48.868 STDOUT [eks] terraform:               ~ Statement = [
10:50:48.869 STDOUT [eks] terraform:                     {
10:50:48.869 STDOUT [eks] terraform:                         Action    = "kms:*"
10:50:48.869 STDOUT [eks] terraform:                         Effect    = "Allow"
10:50:48.869 STDOUT [eks] terraform:                         Principal = {
10:50:48.869 STDOUT [eks] terraform:                             AWS = "arn:aws:iam::079058212236:root"
10:50:48.869 STDOUT [eks] terraform:                         }
10:50:48.869 STDOUT [eks] terraform:                         Resource  = "*"
10:50:48.869 STDOUT [eks] terraform:                         Sid       = "Default"
10:50:48.869 STDOUT [eks] terraform:                     },
10:50:48.870 STDOUT [eks] terraform:                   ~ {
10:50:48.870 STDOUT [eks] terraform:                       ~ Principal = {
10:50:48.870 STDOUT [eks] terraform:                           ~ AWS = "arn:aws:iam::079058212236:user/istram" -> "arn:aws:iam::079058212236:role/github/github-actions-infra-plan20250712203726297300000001"
10:50:48.870 STDOUT [eks] terraform:                         }
10:50:48.870 STDOUT [eks] terraform:                         # (4 unchanged attributes hidden)
10:50:48.870 STDOUT [eks] terraform:                     },
10:50:48.870 STDOUT [eks] terraform:                     {
10:50:48.870 STDOUT [eks] terraform:                         Action    = [
10:50:48.870 STDOUT [eks] terraform:                             "kms:ReEncrypt*",
10:50:48.870 STDOUT [eks] terraform:                             "kms:GenerateDataKey*",
10:50:48.870 STDOUT [eks] terraform:                             "kms:Encrypt",
10:50:48.870 STDOUT [eks] terraform:                             "kms:DescribeKey",
10:50:48.870 STDOUT [eks] terraform:                             "kms:Decrypt",
10:50:48.870 STDOUT [eks] terraform:                         ]
10:50:48.870 STDOUT [eks] terraform:                         Effect    = "Allow"
10:50:48.870 STDOUT [eks] terraform:                         Principal = {
10:50:48.871 STDOUT [eks] terraform:                             AWS = "arn:aws:iam::079058212236:role/eks/cluster/tempest-dev-cluster-20250720163045635900000002"
10:50:48.871 STDOUT [eks] terraform:                         }
10:50:48.871 STDOUT [eks] terraform:                         Resource  = "*"
10:50:48.871 STDOUT [eks] terraform:                         Sid       = "KeyUsage"
10:50:48.871 STDOUT [eks] terraform:                     },
10:50:48.871 STDOUT [eks] terraform:                 ]
10:50:48.871 STDOUT [eks] terraform:                 # (1 unchanged attribute hidden)
10:50:48.871 STDOUT [eks] terraform:             }
10:50:48.871 STDOUT [eks] terraform:         )
10:50:48.871 STDOUT [eks] terraform:         tags                               = {
10:50:48.871 STDOUT [eks] terraform:             "terraform-aws-modules" = "eks"
10:50:48.871 STDOUT [eks] terraform:         }
10:50:48.871 STDOUT [eks] terraform:         # (13 unchanged attributes hidden)
10:50:48.872 STDOUT [eks] terraform:     }
10:50:48.872 STDOUT [eks] terraform: Plan: 0 to add, 9 to change, 0 to destroy.
10:50:48.872 STDOUT [eks] terraform: 
10:50:48.872 STDOUT [eks] terraform: Changes to Outputs:
10:50:48.872 STDOUT [eks] terraform:   ~ cluster_addons                                   = {
10:50:48.872 STDOUT [eks] terraform:       ~ aws-efs-csi-driver        = {
10:50:48.872 STDOUT [eks] terraform:           ~ addon_version               = "v2.1.9-eksbuild.1" -> (known after apply)
10:50:48.872 STDOUT [eks] terraform:             id                          = "tempest-dev:aws-efs-csi-driver"
10:50:48.872 STDOUT [eks] terraform:             tags                        = {}
10:50:48.872 STDOUT [eks] terraform:             # (14 unchanged attributes hidden)
10:50:48.872 STDOUT [eks] terraform:         }
10:50:48.872 STDOUT [eks] terraform:       ~ coredns                   = {
10:50:48.872 STDOUT [eks] terraform:           ~ addon_version               = "v1.12.2-eksbuild.4" -> (known after apply)
10:50:48.872 STDOUT [eks] terraform:             id                          = "tempest-dev:coredns"
10:50:48.872 STDOUT [eks] terraform:             tags                        = {}
10:50:48.872 STDOUT [eks] terraform:             # (14 unchanged attributes hidden)
10:50:48.872 STDOUT [eks] terraform:         }
10:50:48.872 STDOUT [eks] terraform:       ~ eks-node-monitoring-agent = {
10:50:48.872 STDOUT [eks] terraform:           ~ addon_version               = "v1.3.0-eksbuild.2" -> (known after apply)
10:50:48.873 STDOUT [eks] terraform:             id                          = "tempest-dev:eks-node-monitoring-agent"
10:50:48.873 STDOUT [eks] terraform:             tags                        = {}
10:50:48.873 STDOUT [eks] terraform:             # (14 unchanged attributes hidden)
10:50:48.873 STDOUT [eks] terraform:         }
10:50:48.873 STDOUT [eks] terraform:       ~ eks-pod-identity-agent    = {
10:50:48.873 STDOUT [eks] terraform:           ~ addon_version               = "v1.3.8-eksbuild.2" -> (known after apply)
10:50:48.873 STDOUT [eks] terraform:             id                          = "tempest-dev:eks-pod-identity-agent"
10:50:48.873 STDOUT [eks] terraform:             tags                        = {}
10:50:48.873 STDOUT [eks] terraform:             # (14 unchanged attributes hidden)
10:50:48.873 STDOUT [eks] terraform:         }
10:50:48.873 STDOUT [eks] terraform:       ~ kube-proxy                = {
10:50:48.873 STDOUT [eks] terraform:           ~ addon_version               = "v1.33.0-eksbuild.2" -> (known after apply)
10:50:48.873 STDOUT [eks] terraform:             id                          = "tempest-dev:kube-proxy"
10:50:48.873 STDOUT [eks] terraform:             tags                        = {}
10:50:48.873 STDOUT [eks] terraform:             # (14 unchanged attributes hidden)
10:50:48.873 STDOUT [eks] terraform:         }
10:50:48.873 STDOUT [eks] terraform:       ~ metrics-server            = {
10:50:48.873 STDOUT [eks] terraform:           ~ addon_version               = "v0.8.0-eksbuild.1" -> (known after apply)
10:50:48.873 STDOUT [eks] terraform:             id                          = "tempest-dev:metrics-server"
10:50:48.873 STDOUT [eks] terraform:             tags                        = {}
10:50:48.873 STDOUT [eks] terraform:             # (14 unchanged attributes hidden)
10:50:48.873 STDOUT [eks] terraform:         }
10:50:48.873 STDOUT [eks] terraform:     }
10:50:48.873 STDOUT [eks] terraform:   ~ cluster_tls_certificate_sha1_fingerprint         = "06b25927c42a721631c1efd9431e648fa62e1e39" -> (known after apply)
10:50:48.874 STDOUT [eks] terraform:   ~ kms_key_policy                                   = jsonencode(
10:50:48.874 STDOUT [eks] terraform:       ~ {
10:50:48.874 STDOUT [eks] terraform:           ~ Statement = [
10:50:48.874 STDOUT [eks] terraform:                 {
10:50:48.874 STDOUT [eks] terraform:                     Action    = "kms:*"
10:50:48.874 STDOUT [eks] terraform:                     Effect    = "Allow"
10:50:48.874 STDOUT [eks] terraform:                     Principal = {
10:50:48.874 STDOUT [eks] terraform:                         AWS = "arn:aws:iam::079058212236:root"
10:50:48.874 STDOUT [eks] terraform:                     }
10:50:48.874 STDOUT [eks] terraform:                     Resource  = "*"
10:50:48.874 STDOUT [eks] terraform:                     Sid       = "Default"
10:50:48.874 STDOUT [eks] terraform:                 },
10:50:48.874 STDOUT [eks] terraform:               ~ {
10:50:48.874 STDOUT [eks] terraform:                   ~ Principal = {
10:50:48.874 STDOUT [eks] terraform:                       ~ AWS = "arn:aws:iam::079058212236:user/istram" -> "arn:aws:iam::079058212236:role/github/github-actions-infra-plan20250712203726297300000001"
10:50:48.874 STDOUT [eks] terraform:                     }
10:50:48.874 STDOUT [eks] terraform:                     # (4 unchanged attributes hidden)
10:50:48.874 STDOUT [eks] terraform:                 },
10:50:48.874 STDOUT [eks] terraform:                 {
10:50:48.874 STDOUT [eks] terraform:                     Action    = [
10:50:48.874 STDOUT [eks] terraform:                         "kms:ReEncrypt*",
10:50:48.874 STDOUT [eks] terraform:                         "kms:GenerateDataKey*",
10:50:48.874 STDOUT [eks] terraform:                         "kms:Encrypt",
10:50:48.874 STDOUT [eks] terraform:                         "kms:DescribeKey",
10:50:48.874 STDOUT [eks] terraform:                         "kms:Decrypt",
10:50:48.875 STDOUT [eks] terraform:                     ]
10:50:48.875 STDOUT [eks] terraform:                     Effect    = "Allow"
10:50:48.875 STDOUT [eks] terraform:                     Principal = {
10:50:48.875 STDOUT [eks] terraform:                         AWS = "arn:aws:iam::079058212236:role/eks/cluster/tempest-dev-cluster-20250720163045635900000002"
10:50:48.875 STDOUT [eks] terraform:                     }
10:50:48.875 STDOUT [eks] terraform:                     Resource  = "*"
10:50:48.875 STDOUT [eks] terraform:                     Sid       = "KeyUsage"
10:50:48.875 STDOUT [eks] terraform:                 },
10:50:48.875 STDOUT [eks] terraform:             ]
10:50:48.875 STDOUT [eks] terraform:             # (1 unchanged attribute hidden)
10:50:48.875 STDOUT [eks] terraform:         }
10:50:48.875 STDOUT [eks] terraform:     )
10:50:51.866 INFO   [eks-svc] Downloading Terraform configurations from ../../stacks/eks-svc into ./eks-svc/.terragrunt-cache/6Z9yiVJ5Yr-RDY3qcKGmfik7Ly4/qaaRPvfiPI16331-BMfS12cFW_E
10:50:51.889 INFO   [eks-svc] terraform: Initializing the backend...
10:50:52.108 INFO   [wordpress-blog] Downloading Terraform configurations from ../../stacks/wordpress into ./wordpress-blog/.terragrunt-cache/Oq-7VfxVMau8zfRpjyKOgqDak3s/b6RP9HtdDbccBeMcGhySDrWv4aQ
10:50:52.131 INFO   [wordpress-blog] terraform: Initializing the backend...
10:50:52.652 INFO   [eks-svc] terraform: 
10:50:52.652 INFO   [eks-svc] terraform: Successfully configured the backend "s3"! Terraform will automatically
10:50:52.652 INFO   [eks-svc] terraform: use this backend unless the backend configuration changes.
10:50:52.851 INFO   [wordpress-blog] terraform: 
10:50:52.851 INFO   [wordpress-blog] terraform: Successfully configured the backend "s3"! Terraform will automatically
10:50:52.851 INFO   [wordpress-blog] terraform: use this backend unless the backend configuration changes.
10:50:53.417 INFO   [eks-svc] terraform: Initializing modules...
10:50:53.451 INFO   [eks-svc] terraform: Downloading registry.terraform.io/terraform-aws-modules/efs/aws 1.8.0 for efs...
10:50:53.470 INFO   [wordpress-blog] terraform: Initializing modules...
10:50:53.500 INFO   [wordpress-blog] terraform: Downloading registry.terraform.io/terraform-aws-modules/rds-aurora/aws 9.15.0 for database...
10:50:53.678 INFO   [eks-svc] terraform: - efs in .terraform/modules/efs
10:50:53.696 INFO   [eks-svc] terraform: Downloading registry.terraform.io/terraform-aws-modules/iam/aws 5.59.0 for role_alb_controller...
10:50:53.889 INFO   [wordpress-blog] terraform: - database in .terraform/modules/database
10:50:53.891 INFO   [wordpress-blog] terraform: Initializing provider plugins...
10:50:53.891 INFO   [wordpress-blog] terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
10:50:53.916 INFO   [wordpress-blog] terraform: - Finding hashicorp/random versions matching "~> 3.7.2"...
10:50:53.938 INFO   [wordpress-blog] terraform: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
10:50:53.963 INFO   [wordpress-blog] terraform: - Reusing previous version of hashicorp/helm from the dependency lock file
10:50:54.040 INFO   [wordpress-blog] terraform: - Installing hashicorp/aws v6.3.0...
10:50:54.067 INFO   [eks-svc] terraform: - role_alb_controller in .terraform/modules/role_alb_controller/modules/iam-role-for-service-accounts-eks
10:50:54.068 INFO   [eks-svc] terraform: Downloading registry.terraform.io/terraform-aws-modules/iam/aws 5.59.0 for role_efs_csi...
10:50:54.097 INFO   [eks-svc] terraform: - role_efs_csi in .terraform/modules/role_efs_csi/modules/iam-role-for-service-accounts-eks
10:50:54.100 INFO   [eks-svc] terraform: Initializing provider plugins...
10:50:54.100 INFO   [eks-svc] terraform: - Reusing previous version of hashicorp/helm from the dependency lock file
10:50:54.129 INFO   [eks-svc] terraform: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
10:50:54.153 INFO   [eks-svc] terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
10:50:54.295 INFO   [eks-svc] terraform: - Installing hashicorp/helm v3.0.2...
10:50:55.318 INFO   [eks-svc] terraform: - Installed hashicorp/helm v3.0.2 (signed by HashiCorp)
10:50:55.415 INFO   [eks-svc] terraform: - Installing hashicorp/kubernetes v2.37.1...
10:50:56.223 INFO   [eks-svc] terraform: - Installed hashicorp/kubernetes v2.37.1 (signed by HashiCorp)
10:50:56.364 INFO   [eks-svc] terraform: - Installing hashicorp/aws v6.3.0...
10:51:01.443 INFO   [wordpress-blog] terraform: - Installed hashicorp/aws v6.3.0 (signed by HashiCorp)
10:51:01.498 INFO   [wordpress-blog] terraform: - Installing hashicorp/random v3.7.2...
10:51:01.749 INFO   [wordpress-blog] terraform: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
10:51:01.820 INFO   [wordpress-blog] terraform: - Installing hashicorp/kubernetes v2.37.1...
10:51:02.716 INFO   [wordpress-blog] terraform: - Installed hashicorp/kubernetes v2.37.1 (signed by HashiCorp)
10:51:02.812 INFO   [wordpress-blog] terraform: - Installing hashicorp/helm v3.0.2...
10:51:03.720 INFO   [eks-svc] terraform: - Installed hashicorp/aws v6.3.0 (signed by HashiCorp)
10:51:03.720 INFO   [eks-svc] terraform: Terraform has been successfully initialized!
10:51:03.735 INFO   [wordpress-blog] terraform: - Installed hashicorp/helm v3.0.2 (signed by HashiCorp)
10:51:03.735 INFO   [wordpress-blog] terraform: Terraform has made some changes to the provider dependency selections recorded
10:51:03.735 INFO   [wordpress-blog] terraform: in the .terraform.lock.hcl file. Review those changes and commit them to your
10:51:03.736 INFO   [wordpress-blog] terraform: version control system if they represent changes you intended to make.
10:51:03.736 INFO   [wordpress-blog] terraform: Terraform has been successfully initialized!
10:51:08.152 STDOUT [wordpress-blog] terraform: random_password.db_password: Refreshing state... [id=none]
10:51:08.596 STDOUT [wordpress-blog] terraform: module.database.data.aws_partition.current: Reading...
10:51:08.596 STDOUT [wordpress-blog] terraform: data.aws_eks_cluster_auth.this: Reading...
10:51:08.596 STDOUT [wordpress-blog] terraform: module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Reading...
10:51:08.597 STDOUT [wordpress-blog] terraform: data.aws_eks_cluster.this: Reading...
10:51:08.597 STDOUT [wordpress-blog] terraform: module.database.aws_security_group.this[0]: Refreshing state... [id=sg-010eacf33e3ff3d31]
10:51:08.599 STDOUT [wordpress-blog] terraform: data.aws_eks_cluster_auth.this: Read complete after 0s [id=tempest-dev]
10:51:08.599 STDOUT [wordpress-blog] terraform: module.database.data.aws_partition.current: Read complete after 0s [id=aws]
10:51:08.599 STDOUT [wordpress-blog] terraform: module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Read complete after 0s [id=76086537]
10:51:08.601 STDOUT [wordpress-blog] terraform: module.database.aws_iam_role.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20250720171521636600000001]
10:51:08.808 STDOUT [wordpress-blog] terraform: module.database.aws_iam_role_policy_attachment.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20250720171521636600000001/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]
10:51:08.826 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_caller_identity.current: Reading...
10:51:08.826 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_partition.current: Reading...
10:51:08.826 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_caller_identity.current: Reading...
10:51:08.826 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_iam_policy_document.efs_csi[0]: Reading...
10:51:08.826 STDOUT [eks-svc] terraform: data.aws_eks_cluster.this: Reading...
10:51:08.826 STDOUT [eks-svc] terraform: module.efs.aws_efs_file_system.this[0]: Refreshing state... [id=fs-0658cd6d467b1a715]
10:51:08.826 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_partition.current: Reading...
10:51:08.826 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_region.current: Reading...
10:51:08.826 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_region.current: Reading...
10:51:08.826 STDOUT [eks-svc] terraform: data.aws_eks_cluster_auth.this: Reading...
10:51:08.827 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_partition.current: Read complete after 0s [id=aws]
10:51:08.829 STDOUT [eks-svc] terraform: data.aws_eks_cluster_auth.this: Read complete after 0s [id=tempest-dev]
10:51:08.833 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_iam_policy_document.efs_csi[0]: Read complete after 0s [id=3064053908]
10:51:08.835 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_region.current: Read complete after 0s [id=eu-west-1]
10:51:08.836 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_partition.current: Read complete after 0s [id=aws]
10:51:08.836 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_region.current: Read complete after 0s [id=eu-west-1]
10:51:08.839 STDOUT [eks-svc] terraform: module.role_efs_csi.aws_iam_policy.efs_csi[0]: Refreshing state... [id=arn:aws:iam::079058212236:policy/AmazonEKS_EFS_CSI_Policy-20250720200744614000000001]
10:51:08.860 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_iam_policy_document.load_balancer_controller[0]: Reading...
10:51:08.868 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_iam_policy_document.load_balancer_controller[0]: Read complete after 0s [id=1541424006]
10:51:08.873 STDOUT [eks-svc] terraform: module.role_alb_controller.aws_iam_policy.load_balancer_controller[0]: Refreshing state... [id=arn:aws:iam::079058212236:policy/AmazonEKS_AWS_Load_Balancer_Controller-20250720170328253800000002]
10:51:08.905 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_caller_identity.current: Read complete after 0s [id=079058212236]
10:51:08.907 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_iam_policy_document.this[0]: Reading...
10:51:08.909 STDOUT [eks-svc] terraform: module.role_efs_csi.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2072786136]
10:51:08.911 STDOUT [eks-svc] terraform: module.role_efs_csi.aws_iam_role.this[0]: Refreshing state... [id=tempest-dev-efs-csi20250720200744614600000002]
10:51:08.982 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_caller_identity.current: Read complete after 0s [id=079058212236]
10:51:08.984 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_iam_policy_document.this[0]: Reading...
10:51:08.985 STDOUT [eks-svc] terraform: module.role_alb_controller.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2641726104]
10:51:08.987 STDOUT [eks-svc] terraform: module.role_alb_controller.aws_iam_role.this[0]: Refreshing state... [id=tempest-dev-alb-controller20250720170328253100000001]
10:51:09.001 STDOUT [wordpress-blog] terraform: module.database.aws_security_group_rule.this["vpc_ingress"]: Refreshing state... [id=sgrule-241904522]
10:51:09.004 STDOUT [wordpress-blog] terraform: module.database.aws_rds_cluster.this[0]: Refreshing state... [id=tempest-dev-blog]
10:51:09.051 STDOUT [wordpress-blog] terraform: data.aws_eks_cluster.this: Read complete after 0s [id=tempest-dev]
10:51:09.086 STDOUT [eks-svc] terraform: module.role_efs_csi.aws_iam_role_policy_attachment.efs_csi[0]: Refreshing state... [id=tempest-dev-efs-csi20250720200744614600000002/arn:aws:iam::079058212236:policy/AmazonEKS_EFS_CSI_Policy-20250720200744614000000001]
10:51:09.103 STDOUT [eks-svc] terraform: module.role_alb_controller.aws_iam_role_policy_attachment.load_balancer_controller[0]: Refreshing state... [id=tempest-dev-alb-controller20250720170328253100000001/arn:aws:iam::079058212236:policy/AmazonEKS_AWS_Load_Balancer_Controller-20250720170328253800000002]
10:51:09.165 STDOUT [wordpress-blog] terraform: kubernetes_namespace.wordpress: Refreshing state... [id=tempest-dev-blog]
10:51:09.244 STDOUT [eks-svc] terraform: data.aws_eks_cluster.this: Read complete after 0s [id=tempest-dev]
10:51:09.355 STDOUT [eks-svc] terraform: kubernetes_service_account.alb_controller: Refreshing state... [id=kube-system/aws-load-balancer-controller]
10:51:09.359 STDOUT [eks-svc] terraform: module.efs.aws_efs_backup_policy.this[0]: Refreshing state... [id=fs-0658cd6d467b1a715]
10:51:09.359 STDOUT [eks-svc] terraform: kubernetes_storage_class.efs: Refreshing state... [id=efs]
10:51:09.360 STDOUT [eks-svc] terraform: module.efs.data.aws_iam_policy_document.policy[0]: Reading...
10:51:09.362 STDOUT [eks-svc] terraform: module.efs.data.aws_iam_policy_document.policy[0]: Read complete after 0s [id=406307626]
10:51:09.364 STDOUT [eks-svc] terraform: module.efs.aws_efs_file_system_policy.this[0]: Refreshing state... [id=fs-0658cd6d467b1a715]
10:51:09.612 STDOUT [wordpress-blog] terraform: module.database.aws_rds_cluster_instance.this["two"]: Refreshing state... [id=tempest-dev-blog-two]
10:51:09.612 STDOUT [wordpress-blog] terraform: module.database.aws_rds_cluster_instance.this["one"]: Refreshing state... [id=tempest-dev-blog-one]
10:51:09.617 STDOUT [wordpress-blog] terraform: helm_release.wordpress: Refreshing state... [id=tempest-dev-blog]
10:51:09.713 STDOUT [eks-svc] terraform: helm_release.alb_controller: Refreshing state... [id=aws-load-balancer-controller]
10:51:10.794 STDOUT [eks-svc] terraform: No changes. Your infrastructure matches the configuration.
10:51:10.794 STDOUT [eks-svc] terraform: Terraform has compared your real infrastructure against your configuration
10:51:10.795 STDOUT [eks-svc] terraform: and found no differences, so no changes are needed.
10:51:10.795 STDOUT [eks-svc] terraform: ╷
10:51:10.796 STDOUT [eks-svc] terraform: │ Warning: Deprecated attribute
10:51:10.796 STDOUT [eks-svc] terraform: │ 
10:51:10.796 STDOUT [eks-svc] terraform: │   on .terraform/modules/role_alb_controller/modules/iam-role-for-service-accounts-eks/main.tf line 9, in locals:
10:51:10.796 STDOUT [eks-svc] terraform: │    9:   region              = data.aws_region.current.name
10:51:10.796 STDOUT [eks-svc] terraform: │ 
10:51:10.796 STDOUT [eks-svc] terraform: │ The attribute "name" is deprecated. Refer to the provider documentation for
10:51:10.796 STDOUT [eks-svc] terraform: │ details.
10:51:10.796 STDOUT [eks-svc] terraform: │ 
10:51:10.796 STDOUT [eks-svc] terraform: │ (and 3 more similar warnings elsewhere)
10:51:10.796 STDOUT [eks-svc] terraform: ╵
10:51:15.798 STDOUT [wordpress-blog] terraform: No changes. Your infrastructure matches the configuration.
10:51:15.798 STDOUT [wordpress-blog] terraform: Terraform has compared your real infrastructure against your configuration
10:51:15.798 STDOUT [wordpress-blog] terraform: and found no differences, so no changes are needed.
```

</details>
    
